Repository: Erebot/Erebot
Catalog: data/i18n/*/LC_MESSAGES/Erebot.po
Languages: fr_fr

source: %with-words: 0: 0 seconds; 1: 1 second; 2: =#0= seconds; 60/60: <%%min<; 61/60: <%%min<, >%with-words>; 3600/60: <%%hr<; 3601/60: <%%hr<, >%with-words>; 86400/86400: <%%day<; 86401/86400: <%%day<, >%with-words>; 604800/604800: <%%week<; 604801/604800: <%%week<, >%with-words>; %%min: 1: 1 minute; 2: =#0= minutes; %%hr: 1: 1 hour; 2: =#0= hours; %%day: 1: 1 day; 2: =#0= days; %%week: 1: 1 week; 2: =#0= weeks;
fr_fr: %with-words: 0: =#0= seconde; 2: =#0= secondes; 60/60: <%%min<; 61/60: <%%min<, >%with-words>; 3600/60: <%%hr<; 3601/60: <%%hr<, >%with-words>; 86400/86400: <%%day<; 86401/86400: <%%day<, >%with-words>; 604800/604800: <%%week<; 604801/604800: <%%week<, >%with-words>; %%min: 1: 1 minute; 2: =#0= minutes; %%hr: 1: 1 heure; 2: =#0= heures; %%day: 1: 1 jour; 2: =#0= jours; %%week: 1: 1 semaine; 2: =#0= semaines;

source: A modular IRC bot written in PHP
fr_fr: Un bot IRC modulaire écrit en PHP

source: Allocated:
fr_fr: Allouée :

source: Bad channel name
fr_fr: Nom de canal non valide

source: Code is not clean!
fr_fr: Le code n'est pas propre !

source: Connection failed, removing it from the pool
fr_fr: Échec de la connexion, elle n'est plus sous notre contrôle

source: Could not change umask
fr_fr: Impossible de changer l'umask

source: Could not chdir to "%s"
fr_fr: Impossible de changer de dossier vers "%s"

source: Could not connect to "%s"
fr_fr: Impossible de se connecter à "%s"

source: Could not lock pidfile (%s). Is the bot already running?
fr_fr: Impossible de verrouiller le fichier (%s). Est-ce que le bot est déjà lancé ?

source: Could not set group identity to "%(name)s" (%(id)d)
fr_fr: Impossible de changer l'identité du groupe en "%(name)s" (%(id)d)

source: Could not set user identity to "%(name)s" (%(id)d)
fr_fr: Impossible de changer l'identité de l'utilisateur en "%(name)s" (%(id)d)

source: Could not start in the background (unable to fork)
fr_fr: Impossible de démarrer en arrière-plan (échec du fork)

source: Could not start in the background (unable to setsid)
fr_fr: Impossible de démarrer en arrière-plan (échec de setsid)

source: Dispatching "%s" event.
fr_fr: Transmission de l'événement "%s".

source: Dispatching numeric %s.
fr_fr: Transmission de l'événement numérique %s.

source: Do not run the bot in the background. This is the default, unless the -d option is used or the bot is configured otherwise.
fr_fr: Ne pas lancer le bot en arrière-plan. Il s'agit de la valeur par défaut, sauf si l'option -d est utilisée ou configuration contraire.

source: Erebot has stopped
fr_fr: Erebot s'est arrêté

source: Erebot is already running with PID %d
fr_fr: Erebot est déjà lancé avec le PID %d

source: Erebot is starting
fr_fr: Erebot démarre

source: Found another program's PID %(pid)d in pidfile "%(pidfile)s". Exiting
fr_fr: Le PID d'un autre programme (%(pid)d) a été trouvé dans "%(pidfile)s". Abandon

source: Found stalled PID %(pid)d in pidfile "%(pidfile)s". Removing it
fr_fr: Un PID obsolète (%(pid)d) a été trouvé dans "%(pidfile)s". Suppression

source: Got an exception from the rate-limiter module. Assuming implicit approval to send the message.
fr_fr: Une exception a été levée par le module de contrôle du débit. Un accord implicite d'envoi du message a été obtenu.

source: Got exception
fr_fr: Une exception a été levée

source: Limit:
fr_fr: Limite :

source: Loaded configuration data
fr_fr: Données de configuration chargées

source: Loading required modules for "%s"...
fr_fr: Chargement des modules nécessaires pour "%s"...

source: Memory usage:
fr_fr: Utilisation de la mémoire :

source: No active connections... Aborting.
fr_fr: Aucune connexion active... Abandon

source: No configuration file to reload
fr_fr: Aucun fichier de configuration à recharger

source: No more connections to handle, leaving...
fr_fr: Il n'y a plus de connexions à gérer, arrêt en cours...

source: No such group "%s"
fr_fr: Groupe introuvable "%s"

source: No such user "%s"
fr_fr: Utilisateur introuvable "%s"

source: Only root can change group identity! Your current UID is %d
fr_fr: Seul root peut changer l'identité du groupe ! Votre UID actuel est %d

source: Only root can change user identity! Your current UID is %d
fr_fr: Seul root peut changer l'identité de l'utilisateur ! Votre UID actuel est %d

source: PHP archive
fr_fr: archive PHP

source: PID (%(pid)d) written into %(pidfile)s
fr_fr: PID (%(pid)d) écrit dans %(pidfile)s

source: Path to the configuration file to use instead of "Erebot.xml", relative to the current directory.
fr_fr: Chemin vers le fichier de configuration à utiliser au lieu de "Erebot.xml", relatif par rapport au dossier courant.

source: Prompt started in "%s"
fr_fr: Récepteur de commandes démarré dans "%s"

source: Received signal #%(signum)d (%(signame)s)
fr_fr: Réception du signal #%(signum)d (%(signame)s)

source: Reloading the configuration
fr_fr: Rechargement de la configuration

source: Reusing existing connection for network "%s"
fr_fr: Réutilisation de la connexion existante au réseau "%s"

source: Run the bot in the background (daemon). [requires the POSIX and pcntl extensions]
fr_fr: Lancer le bot en arrière-plan (démon). [nécessite les extensions POSIX et pcntl]

source: Set group identity to this GID/group during startup. The default is to NOT change group identity, unless configured otherwise. [requires the POSIX extension]
fr_fr: Assumer l'identité de ce GID/groupe au démarrage. L'identité du groupe N'EST PAS modifiée par défaut, sauf configuration contraire. [nécessite l'extension POSIX]

source: Set user identity to this UID/username during startup. The default is to NOT change user identity, unless configured otherwise. [requires the POSIX extension]
fr_fr: Assumer l'identité de cet UID/utilisateur au démarrage. L'identité de l'utilisateur N'EST PAS modifiée par défaut, sauf configuration contraire. [nécessite l'extension POSIX]

source: Starting the bot in the background...
fr_fr: Démarrage du bot en arrière-plan...

source: Store the bot's PID in this file.
fr_fr: Enregistrer le PID du bot dans ce fichier.

source: Successfully changed group identity to "%(name)s" (%(id)d)
fr_fr: Identité du groupe changée avec succès en "%(name)s" (%(id)d)

source: Successfully changed user identity to "%(name)s" (%(id)d)
fr_fr: Identité de l'utilisateur changée avec succès en "%(name)s" (%(id)d)

source: Successfully connected to "%s"...
fr_fr: Connection réussie à "%s"...

source: Successfully loaded module '%(module)s' [%(source)s]
fr_fr: Module '%(module)s' chargé avec succès [%(source)s]

source: Successfully reloaded the configuration
fr_fr: Configuration rechargée avec succès

source: Successfully started in the background
fr_fr: Démarrage réussi en arrière-plan

source: The pcntl extension is required in order to start the bot in the background
fr_fr: L'extension pcntl est requise pour pouvoir démarrer en arrière-plan

source: The pidfile (%s) contained garbage. Exiting
fr_fr: Le fichier de PID (%s) est corrompu. Abandon

source: The posix extension is needed in order to change group identity.
fr_fr: L'extension posix est requise pour changer l'identité du groupe.

source: The posix extension is needed in order to change user identity.
fr_fr: L'extension posix est requise pour changer l'identité de l'utilisateur.

source: The posix extension is required in order to start the bot in the background
fr_fr: L'extension posix est requise pour pouvoir démarrer en arrière-plan

source: This configuration file is meant for Erebot %(config_version)s, but you are running version %(code_version)s. Things may not work as expected.
fr_fr: Ce fichier de configuration est fait pour Erebot %(config_version)s, mais vous avez lancé la version %(code_version)s. Certains éléments risquent de ne pas fonctionner comme prévu.

source: Trying to connect to "%s"...
fr_fr: Tentative de connexion à "%s"...

source: Unable to write PID to pidfile (%s)
fr_fr: Impossible d'inscrire le PID dans le fichier (%s)

source: Unknown error while checking for the existence of another running instance of Erebot (%s)
fr_fr: Erreur inconnue lors du test d'existence d'une autre instance d'Erebot (%s)

source: Used:
fr_fr: Utilisée :

source: You SHOULD NOT run Erebot as root!
fr_fr: Vous NE DEVRIEZ PAS lancer Erebot en tant que root !

source: regular file
fr_fr: fichier régulier
