Repository: Erebot/Erebot
Catalog: modules/ServerCapabilities/i18n/*/LC_MESSAGES/ServerCapabilities.po
Languages: fr_fr

source: Bad chan prefix
fr_fr: Mauvais préfixe pour un canal

source: Bad channel list ID
fr_fr: Mauvais ID de liste de canaux

source: Bad channel name
fr_fr: Mauvais nom pour un canal

source: Bad prefix
fr_fr: Mauvais préfixe

source: Bad standard name
fr_fr: Nom de standard incorrect

source: Excepts are not available on this server
fr_fr: Les exceptions ne sont pas supportées sur ce serveur

source: Extended bans not supported on this server
fr_fr: Les bans étendus ne sont pas supportés sur ce serveur

source: Invalid channel list ID
fr_fr: ID de liste de canaux invalide

source: Invalid command
fr_fr: Commande invalide

source: Invalid list type
fr_fr: Type de liste invalide

source: Invalid mapping name
fr_fr: Nom de mapping invalide

source: Invalid mode
fr_fr: Mode invalide

source: Invalid modes
fr_fr: Modes invalides

source: Invalid prefix
fr_fr: Préfixe invalide

source: Invalid status
fr_fr: Statut invalide

source: Invalid text type
fr_fr: Type de texte invalide

source: Invites are not available on this server
fr_fr: Les invitations ne sont pas supportées sur ce serveur

source: No SSL information available
fr_fr: Aucune information SSL disponible

source: No charset specified
fr_fr: Aucun jeu de caractères spécifié

source: No limit defined for this text
fr_fr: Aucune limite définie pour ce texte

source: No limit specified
fr_fr: Aucune limite spécifiée

source: No mapping for prefixes
fr_fr: Pas de mapping pour les préfixes

source: No safe channels on this server
fr_fr: Aucun canal sécurisé sur ce serveur

source: No silence limit specified
fr_fr: Aucune limite spécifiée sur le silence

source: No such mapping exists
fr_fr: Mapping introuvable

source: No such mode
fr_fr: Mode introuvable

source: No such prefix
fr_fr: Préfixe introuvable

source: No watch limit specified
fr_fr: Aucune limite spécifiée sur les listes d'observation

source: Not a valid command name
fr_fr: Nom de commande invalide
